//все стимулы
//объект
var base_stimules = {
	//два массива
	'1': {
		targets: [
			"Текап", 
			"Вирак",  
			"Нозес",
			"Сукет",
			"Гопас",
			"Добан",
			"Сурив",
			"Тевор",
			"Косеп",
			"Сезор",
			"Тевос",
			"Вирод",
			"Робан",
			"Корив",
			"Телоп",
			"Расеп",
			"Намор",
			"Ралоп",
			"Доран",
			"Пазес",
			"Каруд",
			"Совир",
			"Равот",
			"Паког"	
		],
		check: [
			"Голет",
			"Совар",
			"Корив",
			"Сукет",
			"Набод",
			"Дорив",
			"Темор",
			"Равот",
			"Вирод",
			"Робан",
			"Паког",
			"Теруд",
			"Нозет",
			"Каруд",
			"Себан",
			"Расеп",
			"Тезон",
			"Добан", 
			"Текап",
			"Равос",
			"Косеп",
			"Песан",
			"Совир",
			"Доран",
			"Пасод",
			"Торак",
			"Намор",
			"Кавот",
			"Пазес",
			"Тевор",
			"Намец",
			"Сапон",
			"Нозес",
			"Сурив",
			"Допас",
			"Ралоп",
			"Вирок",
			"Пеман", 
			"Гопас",
			"Вирак",
			"Телог",
			"Песар",
			"Совар",
			"Гопуд",
			"Сезор",
			"Тевос",
			"Телоп",
			"Ровет"	
		],
		get_progress: function(counter) {
			return(counter / this.get_all().length * 100)
		},
		get_tg: function() {
			return(this.targets)
		},
		get_all: function() {
			return(this.check)
		},


	},
	'2': {
		targets: [
			"Корив",
			"Тевос",
			"Вирод",
			"Сурив",
			"Ралоп",
			"Гопас",
			"Сезор",
			"Телоп",
			"Вирак",
			"Намор",
			"Расеп",
			"Доран",
			"Тевор",
			"Косеп",
			"Паког",
			"Нозес",
			"Добан",
			"Равот",
			"Совир",
			"Текап",
			"Сукет",
			"Робан",
			"Пазес",
			"Каруд"	
		],
		check: [
			"Сезор",
			"Нозес",
			"Добан",
			"Песан",
			"Ровет",
			"Намор",
			"Сапон",
			"Косеп",
			"Допас",
			"Корив",
			"Совар",
			"Набод",
			"Вирод",
			"Телог",
			"Доран",
			"Вирак",
			"Каруд",
			"Равос", 
			"Вирок",
			"Гопуд",
			"Сукет",
			"Тезон",
			"Робан",
			"Дорив",
			"Нозет",
			"Ралоп",
			"Совир",
			"Кавот",
			"Гопас",
			"Торак",
			"Пасод",
			"Себан",
			"Текап",
			"Песар",
			"Сурив",
			"Телоп", 
			"Совар",
			"Теруд",
			"Паког",
			"Тевос",
			"Пазес",
			"Пеман",
			"Тевор",
			"Голет",
			"Темор",
			"Равот",
			"Намеп",
			"Расеп"	
		],
		get_progress: function(counter) {
			return(counter / this.get_all().length * 100)
		},
		get_tg: function() {
			return(this.targets)
		},
		get_all: function() {
			return(this.check)
		},
	
	}
}
//выбранна последовательность 
var stimules = [],
	params = {};

//при старте страницы	
	params = window
				.location
				.search
				.replace('?','')
				.split('&')
				.reduce(
				    function(p,e){
				        var a = e.split('=');
				        p[ decodeURIComponent(a[0])] = decodeURIComponent(a[1]);
				        return p;
				    },
				    {}
				);

if(params['cb'] == undefined)
	stimules = base_stimules['1']
else
	stimules = base_stimules[params['cb']];

