// Define study
const study = lab.util.fromObject({
  "title": "root",
  "type": "lab.flow.Sequence",
  "parameters": {},
  "plugins": [
    {
      "type": "lab.plugins.Metadata",
      "path": undefined
    },
    {
      "type": "lab.plugins.Download",
      "filePrefix": "rec_diana_exp",
      "path": undefined
    }
  ],
  "metadata": {
    "title": "rec_diana_exp",
    "description": "",
    "repository": "",
    "contributors": ""
  },
  "files": {},
  "responses": {},
  "content": [
    {
      "type": "lab.html.Page",
      "items": [
        {
          "type": "text",
          "title": "\u003Ccenter\u003EАнкета\u003C\u002Fcenter\u003E",
          "content": "\u003Ccenter\u003E\u003Cp3\u003EСпасибо за участие в исследовании! Подалуйста, ответьте на вопросы, представленные ниже\u003C\u002Fp3\u003E\u003C\u002Fcenter\u003E"
        },
        {
          "required": true,
          "type": "input",
          "label": "Введите Ваш код участника:",
          "name": "ID"
        },
        {
          "required": true,
          "type": "radio",
          "label": "Ваш пол:",
          "options": [
            {
              "label": "Женский "
            },
            {
              "label": "Мужской"
            }
          ],
          "name": "Sex"
        },
        {
          "required": true,
          "type": "input",
          "label": "Ваш возраст:",
          "name": "Age"
        },
        {
          "required": true,
          "type": "radio",
          "label": "Даете ли Вы свое добровольное согласие на участие в эксперименте?",
          "options": [
            {
              "label": "Да"
            }
          ],
          "name": "Agreement"
        }
      ],
      "scrollTop": true,
      "submitButtonText": "Продолжить →",
      "submitButtonPosition": "right",
      "files": {},
      "responses": {
        "": ""
      },
      "parameters": {},
      "messageHandlers": {},
      "title": "Анкета"
    },
    {
      "type": "lab.html.Page",
      "items": [
        {
          "type": "text",
          "content": "\u003Ccenter\u003E\n\u003Ch2\u003EИнструкция\u003C\u002Fh2\u003E\n\u003Cmain class=\"content-horizontal-center content-vertical-center\";\u003E\n\u003Cp style=\"font-size: 20px; text-align: justify; max-width: 1500px;\"\u003EНа экране Вам будут предъявляться слова парами. Одно, написанное\n  \u003Cspan style=\"color: red; font-weight: bold;\"\u003Eкрасным\u003C\u002Fspan\u003E цветом, — будет располагаться сверху,\n      второе, написанное \u003Cspan style=\"color: green; font-weight: bold;\"\u003Eзеленым\u003C\u002Fspan\u003E цветом, — снизу.\n      Ваша задача — называть вслух красное слово, игнорируя при этом зеленое слово снизу. Как только Вы увидете пару слов на экране, Вам неоходимо будет как можно быстрее назвать вслух красное слово и затем нажать пробел. Не нажимайте пробел до того как назовете слово. Старайтесь говорить громко и четко.\n      Перед основной частью эксперимента у Вас будет возможность потренироваться.\u003C\u002Fp\u003E\n\u003C\u002Fmain\u003E\n\u003Cbr\u003E\nНажмите \u003Ckbd\u003EПРОБЕЛ\u003C\u002Fkbd\u003E, чтобы продолжить \n\u003C\u002Fcenter\u003E"
        }
      ],
      "scrollTop": true,
      "submitButtonText": "Да →",
      "submitButtonPosition": "hidden",
      "files": {},
      "responses": {
        "keydown(Enter)": "Enter",
        "keydown(Space)": "Probel"
      },
      "parameters": {},
      "messageHandlers": {
        "before:prepare": function anonymous(
) {
shuffle = function (array) {
 let currentIndex = array.length,  randomIndex;

  // While there remain elements to shuffle.
  while (currentIndex > 0) {

    // Pick a remaining element.
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex--;

    // And swap it with the current element.
    [array[currentIndex], array[randomIndex]] = [
      array[randomIndex], array[currentIndex]];
  }

  return array;
};

const urlParams = new URLSearchParams(window.location.search);
window.list = urlParams.get('list');
if(list == null) list = 0;

let test = [
{"Прайм_цель": "ЧАСЫ", "Прайм_дист": "СЛОН", "Осн_цель": "СЛОН", "Осн_дист": "КОВШ", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "тренировка", "Тип_прайминга": "1"},
{"Прайм_цель": "МОРЖ", "Прайм_дист": "ПЛОТ", "Осн_цель": "МОРЖ", "Осн_дист": "ВЕСЫ", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "тренировка", "Тип_прайминга": "1"},
{"Прайм_цель": "ЁЛКА", "Прайм_дист": "КРОТ", "Осн_цель": "КЛЕЙ", "Осн_дист": "ЛУПА", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "тренировка", "Тип_прайминга": "1" },
{"Прайм_цель": "КИВИ", "Прайм_дист": "ПОЯС", "Осн_цель": "ДИСК", "Осн_дист": "ДЫНЯ", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "тренировка", "Тип_прайминга": "1"},
{"Прайм_цель": "ГРИБ", "Прайм_дист": "ОЧКИ","Осн_цель": "БИТА", "Осн_дист": "ЛАЙМ", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "тренировка", "Тип_прайминга": "1"},
]
window.stimules = [];
window.stimules[0] = [ //первый лист
{"Прайм_цель": "ТИГР", "Прайм_дист": "ШКАФ", "Осн_цель": "ТИГР", "Осн_дист": "ГИРЯ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ТИГР", "Прайм_дист": "СТУЛ", "Осн_цель": "ВОЛК", "Осн_дист": "МЫЛО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ТИГР", "Прайм_дист": "СИТО", "Осн_цель": "СОВА", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ТИГР", "Прайм_дист": "ИГЛА", "Осн_цель": "УТКА", "Осн_дист": "ЗОНТ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ТИГР", "Прайм_дист": "ГИРЯ", "Осн_цель": "РОЗА", "Осн_дист": "ШКАФ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ТИГР", "Прайм_дист": "МЫЛО", "Осн_цель": "ПИОН", "Осн_дист": "СТУЛ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ТИГР", "Прайм_дист": "ЗОНТ", "Осн_цель": "ЛИПА", "Осн_дист": "ИГЛА", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ТИГР", "Прайм_дист": "ПЛАЩ", "Осн_цель": "КЛЁН", "Осн_дист": "СИТО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "ШКАФ", "Осн_цель": "ТИГР", "Осн_дист": "ГИРЯ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "СТУЛ", "Осн_цель": "ВОЛК", "Осн_дист": "МЫЛО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "СИТО", "Осн_цель": "СОВА", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "ИГЛА", "Осн_цель": "УТКА", "Осн_дист": "ЗОНТ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "ГИРЯ", "Осн_цель": "РОЗА", "Осн_дист": "ШКАФ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "МЫЛО", "Осн_цель": "ПИОН", "Осн_дист": "СТУЛ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "ЗОНТ", "Осн_цель": "ЛИПА", "Осн_дист": "ИГЛА", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "ПЛАЩ", "Осн_цель": "КЛЁН", "Осн_дист": "СИТО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "ШКАФ", "Осн_цель": "ТИГР", "Осн_дист": "ГИРЯ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "СТУЛ", "Осн_цель": "ВОЛК", "Осн_дист": "МЫЛО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "СИТО", "Осн_цель": "СОВА", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "ИГЛА", "Осн_цель": "УТКА", "Осн_дист": "ЗОНТ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "ГИРЯ", "Осн_цель": "РОЗА", "Осн_дист": "ШКАФ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "МЫЛО", "Осн_цель": "ПИОН", "Осн_дист": "СТУЛ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "ЗОНТ", "Осн_цель": "ЛИПА", "Осн_дист": "ИГЛА", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "ПЛАЩ", "Осн_цель": "КЛЁН", "Осн_дист": "СИТО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },

//Негативный прайминг
{"Прайм_цель": "ИГЛА", "Прайм_дист": "ВОЛК", "Осн_цель": "ТИГР", "Осн_дист": "ЗОНТ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СИТО", "Прайм_дист": "ВОЛК", "Осн_цель": "ВОЛК", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СТУЛ", "Прайм_дист": "ВОЛК", "Осн_цель": "СОВА", "Осн_дист": "МЫЛО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ШКАФ", "Прайм_дист": "ВОЛК", "Осн_цель": "УТКА", "Осн_дист": "ГИРЯ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "ВОЛК", "Осн_цель": "РОЗА", "Осн_дист": "ИГЛА", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "ВОЛК", "Осн_цель": "ПИОН", "Осн_дист": "СИТО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "МЫЛО", "Прайм_дист": "ВОЛК", "Осн_цель": "ЛИПА", "Осн_дист": "СТУЛ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "ВОЛК", "Осн_цель": "КЛЁН", "Осн_дист": "ШКАФ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ИГЛА", "Прайм_дист": "РОЗА", "Осн_цель": "ТИГР", "Осн_дист": "ЗОНТ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СИТО", "Прайм_дист": "РОЗА", "Осн_цель": "ВОЛК", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СТУЛ", "Прайм_дист": "РОЗА", "Осн_цель": "СОВА", "Осн_дист": "МЫЛО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ШКАФ", "Прайм_дист": "РОЗА", "Осн_цель": "УТКА", "Осн_дист": "ГИРЯ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "РОЗА", "Осн_цель": "РОЗА", "Осн_дист": "ИГЛА", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "РОЗА", "Осн_цель": "ПИОН", "Осн_дист": "СИТО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "МЫЛО", "Прайм_дист": "РОЗА", "Осн_цель": "ЛИПА", "Осн_дист": "СТУЛ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "РОЗА", "Осн_цель": "КЛЁН", "Осн_дист": "ШКАФ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ИГЛА", "Прайм_дист": "КЛЁН", "Осн_цель": "ТИГР", "Осн_дист": "ЗОНТ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СИТО", "Прайм_дист": "КЛЁН", "Осн_цель": "ВОЛК", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СТУЛ", "Прайм_дист": "КЛЁН", "Осн_цель": "СОВА", "Осн_дист": "МЫЛО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ШКАФ", "Прайм_дист": "КЛЁН", "Осн_цель": "УТКА", "Осн_дист": "ГИРЯ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "КЛЁН", "Осн_цель": "РОЗА", "Осн_дист": "ИГЛА", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "КЛЁН", "Осн_цель": "ПИОН", "Осн_дист": "СИТО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "МЫЛО", "Прайм_дист": "КЛЁН", "Осн_цель": "ЛИПА", "Осн_дист": "СТУЛ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "КЛЁН", "Осн_цель": "КЛЁН", "Осн_дист": "ШКАФ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная"},

//Контроль
{"Прайм_цель": "СОВА", "Прайм_дист": "ТИГР", "Осн_цель": "ШКАФ", "Осн_дист": "ГИРЯ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "СОВА", "Прайм_дист": "ВОЛК", "Осн_цель": "СТУЛ", "Осн_дист": "МЫЛО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "СОВА", "Прайм_дист": "ЛИПА", "Осн_цель": "СИТО", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "СОВА", "Прайм_дист": "УТКА", "Осн_цель": "ИГЛА", "Осн_дист": "ЗОНТ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "СОВА", "Осн_цель": "ГИРЯ", "Осн_дист": "ШКАФ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "СОВА", "Осн_цель": "МЫЛО", "Осн_дист": "СТУЛ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "СОВА", "Осн_цель": "ЗОНТ", "Осн_дист": "ИГЛА", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "СОВА", "Осн_цель": "ПЛАЩ", "Осн_дист": "СИТО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "ТИГР", "Осн_цель": "ШКАФ", "Осн_дист": "МЫЛО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "ВОЛК", "Осн_цель": "СТУЛ", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "СОВА", "Осн_цель": "СИТО", "Осн_дист": "ЗОНТ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "УТКА", "Осн_цель": "ИГЛА", "Осн_дист": "ШКАФ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "ПИОН", "Осн_цель": "ГИРЯ", "Осн_дист": "СТУЛ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ВОЛК", "Прайм_дист": "ПИОН", "Осн_цель": "МЫЛО", "Осн_дист": "ИГЛА", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "ПИОН", "Осн_цель": "ЗОНТ", "Осн_дист": "СИТО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "ПИОН", "Осн_цель": "ПЛАЩ", "Осн_дист": "ГИРЯ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ШКАФ", "Прайм_дист": "ЗОНТ", "Осн_цель": "СТУЛ", "Осн_дист": "СИТО", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "СТУЛ", "Прайм_дист": "ШКАФ", "Осн_цель": "ИГЛА", "Осн_дист": "ГИРЯ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "СИТО", "Прайм_дист": "МЫЛО", "Осн_цель": "СИТО", "Осн_дист": "ИГЛА", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ИГЛА", "Прайм_дист": "СТУЛ", "Осн_цель": "ГИРЯ", "Осн_дист": "МЫЛО", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "СИТО", "Осн_цель": "МЫЛО", "Осн_дист": "ЗОНТ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "ГИРЯ", "Осн_цель": "ПЛАЩ", "Осн_дист": "ШКАФ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "МЫЛО", "Прайм_дист": "ИГЛА", "Осн_цель": "ЗОНТ", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "МЫЛО", "Осн_цель": "ШКАФ", "Осн_дист": "СТУЛ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ШКАФ", "Прайм_дист": "СТУЛ", "Осн_цель": "ЗОНТ", "Осн_дист": "ШКАФ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "СТУЛ", "Прайм_дист": "ШКАФ", "Осн_цель": "ИГЛА", "Осн_дист": "СТУЛ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "СИТО", "Прайм_дист": "СТУЛ", "Осн_цель": "МЫЛО", "Осн_дист": "СИТО", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ИГЛА", "Прайм_дист": "СИТО", "Осн_цель": "ГИРЯ", "Осн_дист": "ИГЛА", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "ИГЛА", "Осн_цель": "СИТО", "Осн_дист": "ГИРЯ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "МЫЛО", "Прайм_дист": "ГИРЯ", "Осн_цель": "ПЛАЩ", "Осн_дист": "МЫЛО", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "ПЛАЩ", "Осн_цель": "ШКАФ", "Осн_дист": "ЗОНТ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "МЫЛО", "Осн_цель": "ЗОНТ", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"}
];
window.stimules[1] = [//второй лист
//Позитивный прайминг
{"Прайм_цель": "СОВА", "Прайм_дист": "ШКАФ", "Осн_цель": "ТИГР", "Осн_дист": "ГИРЯ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СОВА", "Прайм_дист": "СТУЛ", "Осн_цель": "ВОЛК", "Осн_дист": "МЫЛО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СОВА", "Прайм_дист": "СИТО", "Осн_цель": "СОВА", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СОВА", "Прайм_дист": "ИГЛА", "Осн_цель": "УТКА", "Осн_дист": "ЗОНТ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СОВА", "Прайм_дист": "ГИРЯ", "Осн_цель": "РОЗА", "Осн_дист": "ШКАФ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СОВА", "Прайм_дист": "МЫЛО", "Осн_цель": "ПИОН", "Осн_дист": "СТУЛ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СОВА", "Прайм_дист": "ЗОНТ", "Осн_цель": "ЛИПА", "Осн_дист": "ИГЛА", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СОВА", "Прайм_дист": "ПЛАЩ", "Осн_цель": "КЛЁН", "Осн_дист": "СИТО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "ШКАФ", "Осн_цель": "ТИГР", "Осн_дист": "ГИРЯ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "СТУЛ", "Осн_цель": "ВОЛК", "Осн_дист": "МЫЛО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "СИТО", "Осн_цель": "СОВА", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "ИГЛА", "Осн_цель": "УТКА", "Осн_дист": "ЗОНТ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "ГИРЯ", "Осн_цель": "РОЗА", "Осн_дист": "ШКАФ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "МЫЛО", "Осн_цель": "ПИОН", "Осн_дист": "СТУЛ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "ЗОНТ", "Осн_цель": "ЛИПА", "Осн_дист": "ИГЛА", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "ПЛАЩ", "Осн_цель": "КЛЁН", "Осн_дист": "СИТО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная"},

//Негативный прайминг
{"Прайм_цель": "ИГЛА", "Прайм_дист": "ТИГР", "Осн_цель": "ТИГР", "Осн_дист": "ЗОНТ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СИТО", "Прайм_дист": "ТИГР", "Осн_цель": "ВОЛК", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СТУЛ", "Прайм_дист": "ТИГР", "Осн_цель": "СОВА", "Осн_дист": "МЫЛО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ШКАФ", "Прайм_дист": "ТИГР", "Осн_цель": "УТКА", "Осн_дист": "ГИРЯ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "ТИГР", "Осн_цель": "РОЗА", "Осн_дист": "ИГЛА", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "ТИГР", "Осн_цель": "ПИОН", "Осн_дист": "СИТО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "МЫЛО", "Прайм_дист": "ТИГР", "Осн_цель": "ЛИПА", "Осн_дист": "СТУЛ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "ТИГР", "Осн_цель": "КЛЁН", "Осн_дист": "ШКАФ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ИГЛА", "Прайм_дист": "УТКА", "Осн_цель": "ТИГР", "Осн_дист": "ЗОНТ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СИТО", "Прайм_дист": "УТКА", "Осн_цель": "ВОЛК", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СТУЛ", "Прайм_дист": "УТКА", "Осн_цель": "СОВА", "Осн_дист": "МЫЛО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ШКАФ", "Прайм_дист": "УТКА", "Осн_цель": "УТКА", "Осн_дист": "ГИРЯ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "УТКА", "Осн_цель": "РОЗА", "Осн_дист": "ИГЛА", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "УТКА", "Осн_цель": "ПИОН", "Осн_дист": "СИТО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "МЫЛО", "Прайм_дист": "УТКА", "Осн_цель": "ЛИПА", "Осн_дист": "СТУЛ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "УТКА", "Осн_цель": "КЛЁН", "Осн_дист": "ШКАФ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ИГЛА", "Прайм_дист": "ЛИПА", "Осн_цель": "ТИГР", "Осн_дист": "ЗОНТ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СИТО", "Прайм_дист": "ЛИПА", "Осн_цель": "ВОЛК", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СТУЛ", "Прайм_дист": "ЛИПА", "Осн_цель": "СОВА", "Осн_дист": "МЫЛО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ШКАФ", "Прайм_дист": "ЛИПА", "Осн_цель": "УТКА", "Осн_дист": "ГИРЯ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "ЛИПА", "Осн_цель": "РОЗА", "Осн_дист": "ИГЛА", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "ЛИПА", "Осн_цель": "ПИОН", "Осн_дист": "СИТО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "МЫЛО", "Прайм_дист": "ЛИПА", "Осн_цель": "ЛИПА", "Осн_дист": "СТУЛ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "ЛИПА", "Осн_цель": "КЛЁН", "Осн_дист": "ШКАФ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная"},

//Контроль
{"Прайм_цель": "ВОЛК", "Прайм_дист": "ТИГР", "Осн_цель": "ШКАФ", "Осн_дист": "МЫЛО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ВОЛК", "Прайм_дист": "ПИОН", "Осн_цель": "СТУЛ", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ВОЛК", "Прайм_дист": "СОВА", "Осн_цель": "СИТО", "Осн_дист": "ЗОНТ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ВОЛК", "Прайм_дист": "УТКА", "Осн_цель": "ИГЛА", "Осн_дист": "ШКАФ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "ВОЛК", "Осн_цель": "ГИРЯ", "Осн_дист": "СТУЛ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "ВОЛК", "Осн_цель": "МЫЛО", "Осн_дист": "ИГЛА", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "ВОЛК", "Осн_цель": "ЗОНТ", "Осн_дист": "СИТО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "ВОЛК", "Осн_цель": "ПЛАЩ", "Осн_дист": "ГИРЯ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "ТИГР", "Осн_цель": "ШКАФ", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "ВОЛК", "Осн_цель": "СТУЛ", "Осн_дист": "ЗОНТ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "СОВА", "Осн_цель": "СИТО", "Осн_дист": "ШКАФ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "УТКА", "Осн_цель": "ИГЛА", "Осн_дист": "СТУЛ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ТИГР", "Прайм_дист": "РОЗА", "Осн_цель": "ГИРЯ", "Осн_дист": "ИГЛА", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "РОЗА", "Осн_цель": "МЫЛО", "Осн_дист": "СИТО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "РОЗА", "Осн_цель": "ЗОНТ", "Осн_дист": "ГИРЯ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "РОЗА", "Осн_цель": "ПЛАЩ", "Осн_дист": "МЫЛО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "ТИГР", "Осн_цель": "ШКАФ", "Осн_дист": "ГИРЯ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "ВОЛК", "Осн_цель": "СТУЛ", "Осн_дист": "МЫЛО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "СОВА", "Осн_цель": "СИТО", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "УТКА", "Осн_цель": "ИГЛА", "Осн_дист": "ЗОНТ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "КЛЁН", "Осн_цель": "ГИРЯ", "Осн_дист": "ШКАФ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "КЛЁН", "Осн_цель": "МЫЛО", "Осн_дист": "СТУЛ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "КЛЁН", "Осн_цель": "ЗОНТ", "Осн_дист": "ИГЛА", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "КЛЁН", "Осн_цель": "ПЛАЩ", "Осн_дист": "СИТО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ШКАФ", "Прайм_дист": "ЗОНТ", "Осн_цель": "СТУЛ", "Осн_дист": "СИТО", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "СТУЛ", "Прайм_дист": "ШКАФ", "Осн_цель": "ИГЛА", "Осн_дист": "ГИРЯ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "СИТО", "Прайм_дист": "МЫЛО", "Осн_цель": "СИТО", "Осн_дист": "ИГЛА", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ИГЛА", "Прайм_дист": "СТУЛ", "Осн_цель": "ГИРЯ", "Осн_дист": "МЫЛО", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "СИТО", "Осн_цель": "МЫЛО", "Осн_дист": "ЗОНТ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "ГИРЯ", "Осн_цель": "ПЛАЩ", "Осн_дист": "ШКАФ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "МЫЛО", "Прайм_дист": "ИГЛА", "Осн_цель": "ЗОНТ", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "МЫЛО", "Осн_цель": "ШКАФ", "Осн_дист": "СТУЛ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ШКАФ", "Прайм_дист": "СТУЛ", "Осн_цель": "ЗОНТ", "Осн_дист": "ШКАФ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "СТУЛ", "Прайм_дист": "ШКАФ", "Осн_цель": "ИГЛА", "Осн_дист": "СТУЛ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "СИТО", "Прайм_дист": "СТУЛ", "Осн_цель": "МЫЛО", "Осн_дист": "СИТО", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ИГЛА", "Прайм_дист": "СИТО", "Осн_цель": "ГИРЯ", "Осн_дист": "ИГЛА", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "ИГЛА", "Осн_цель": "СИТО", "Осн_дист": "ГИРЯ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "МЫЛО", "Прайм_дист": "ГИРЯ", "Осн_цель": "ПЛАЩ", "Осн_дист": "МЫЛО", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "ПЛАЩ", "Осн_цель": "ШКАФ", "Осн_дист": "ЗОНТ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "МЫЛО", "Осн_цель": "ЗОНТ", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"}
];
window.stimules[2] = [//третьий лист
//Позитивный прайминг
{"Прайм_цель": "ВОЛК", "Прайм_дист": "ШКАФ", "Осн_цель": "ТИГР", "Осн_дист": "ГИРЯ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ВОЛК", "Прайм_дист": "СТУЛ", "Осн_цель": "ВОЛК", "Осн_дист": "МЫЛО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ВОЛК", "Прайм_дист": "СИТО", "Осн_цель": "СОВА", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ВОЛК", "Прайм_дист": "ИГЛА", "Осн_цель": "УТКА", "Осн_дист": "ЗОНТ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ВОЛК", "Прайм_дист": "ГИРЯ", "Осн_цель": "РОЗА", "Осн_дист": "ШКАФ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ВОЛК", "Прайм_дист": "МЫЛО", "Осн_цель": "ПИОН", "Осн_дист": "СТУЛ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ВОЛК", "Прайм_дист": "ЗОНТ", "Осн_цель": "ЛИПА", "Осн_дист": "ИГЛА", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ВОЛК", "Прайм_дист": "ПЛАЩ", "Осн_цель": "КЛЁН", "Осн_дист": "СИТО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "ШКАФ", "Осн_цель": "ТИГР", "Осн_дист": "ГИРЯ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "СТУЛ", "Осн_цель": "ВОЛК", "Осн_дист": "МЫЛО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "СИТО", "Осн_цель": "СОВА", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "ИГЛА", "Осн_цель": "УТКА", "Осн_дист": "ЗОНТ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "ГИРЯ", "Осн_цель": "РОЗА", "Осн_дист": "ШКАФ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "МЫЛО", "Осн_цель": "ПИОН", "Осн_дист": "СТУЛ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "ЗОНТ", "Осн_цель": "ЛИПА", "Осн_дист": "ИГЛА", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "ПЛАЩ", "Осн_цель": "КЛЁН", "Осн_дист": "СИТО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "ШКАФ", "Осн_цель": "ТИГР", "Осн_дист": "ГИРЯ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "СТУЛ", "Осн_цель": "ВОЛК", "Осн_дист": "МЫЛО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "СИТО", "Осн_цель": "СОВА", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "ИГЛА", "Осн_цель": "УТКА", "Осн_дист": "ЗОНТ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "ГИРЯ", "Осн_цель": "РОЗА", "Осн_дист": "ШКАФ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "МЫЛО", "Осн_цель": "ПИОН", "Осн_дист": "СТУЛ", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "ЗОНТ", "Осн_цель": "ЛИПА", "Осн_дист": "ИГЛА", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "ПЛАЩ", "Осн_цель": "КЛЁН", "Осн_дист": "СИТО", "Тип_прайминга": "1", "Ответ_прайм": "живое", "Ответ_цель": "живое", "Тип_пробы": "основная"},

//Негативный прайминг
{"Прайм_цель": "ИГЛА", "Прайм_дист": "СОВА", "Осн_цель": "ТИГР", "Осн_дист": "ЗОНТ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СИТО", "Прайм_дист": "СОВА", "Осн_цель": "ВОЛК", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СТУЛ", "Прайм_дист": "СОВА", "Осн_цель": "СОВА", "Осн_дист": "МЫЛО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ШКАФ", "Прайм_дист": "СОВА", "Осн_цель": "УТКА", "Осн_дист": "ГИРЯ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "СОВА", "Осн_цель": "РОЗА", "Осн_дист": "ИГЛА", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "СОВА", "Осн_цель": "ПИОН", "Осн_дист": "СИТО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "МЫЛО", "Прайм_дист": "СОВА", "Осн_цель": "ЛИПА", "Осн_дист": "СТУЛ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "СОВА", "Осн_цель": "КЛЁН", "Осн_дист": "ШКАФ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ИГЛА", "Прайм_дист": "ПИОН", "Осн_цель": "ТИГР", "Осн_дист": "ЗОНТ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СИТО", "Прайм_дист": "ПИОН", "Осн_цель": "ВОЛК", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "СТУЛ", "Прайм_дист": "ПИОН", "Осн_цель": "СОВА", "Осн_дист": "МЫЛО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ШКАФ", "Прайм_дист": "ПИОН", "Осн_цель": "УТКА", "Осн_дист": "ГИРЯ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "ПИОН", "Осн_цель": "РОЗА", "Осн_дист": "ИГЛА", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "ПИОН", "Осн_цель": "ПИОН", "Осн_дист": "СИТО", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "МЫЛО", "Прайм_дист": "ПИОН", "Осн_цель": "ЛИПА", "Осн_дист": "СТУЛ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная" },
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "ПИОН", "Осн_цель": "КЛЁН", "Осн_дист": "ШКАФ", "Тип_прайминга": "2", "Ответ_прайм": "неживое", "Ответ_цель": "живое", "Тип_пробы": "основная"},

//Контроль
{"Прайм_цель": "ТИГР", "Прайм_дист": "РОЗА", "Осн_цель": "ШКАФ", "Осн_дист": "ГИРЯ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ТИГР", "Прайм_дист": "ВОЛК", "Осн_цель": "СТУЛ", "Осн_дист": "МЫЛО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ТИГР", "Прайм_дист": "СОВА", "Осн_цель": "СИТО", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ТИГР", "Прайм_дист": "УТКА", "Осн_цель": "ИГЛА", "Осн_дист": "ЗОНТ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "ТИГР", "Осн_цель": "ГИРЯ", "Осн_дист": "ШКАФ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "ТИГР", "Осн_цель": "МЫЛО", "Осн_дист": "СТУЛ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "ТИГР", "Осн_цель": "ЗОНТ", "Осн_дист": "ИГЛА", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "ТИГР", "Осн_цель": "ПЛАЩ", "Осн_дист": "СИТО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "ТИГР", "Осн_цель": "ШКАФ", "Осн_дист": "МЫЛО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "ВОЛК", "Осн_цель": "СТУЛ", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "СОВА", "Осн_цель": "СИТО", "Осн_дист": "ЗОНТ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "УТКА", "Прайм_дист": "КЛЁН", "Осн_цель": "ИГЛА", "Осн_дист": "ШКАФ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "УТКА", "Осн_цель": "ГИРЯ", "Осн_дист": "СТУЛ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "УТКА", "Осн_цель": "МЫЛО", "Осн_дист": "ИГЛА", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "УТКА", "Осн_цель": "ЗОНТ", "Осн_дист": "СИТО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "УТКА", "Осн_цель": "ПЛАЩ", "Осн_дист": "ГИРЯ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "ТИГР", "Осн_цель": "ШКАФ", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "ВОЛК", "Осн_цель": "СТУЛ", "Осн_дист": "ЗОНТ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "СОВА", "Осн_цель": "СИТО", "Осн_дист": "ШКАФ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ЛИПА", "Прайм_дист": "УТКА", "Осн_цель": "ИГЛА", "Осн_дист": "СТУЛ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "РОЗА", "Прайм_дист": "ЛИПА", "Осн_цель": "ГИРЯ", "Осн_дист": "ИГЛА", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "ПИОН", "Прайм_дист": "ЛИПА", "Осн_цель": "МЫЛО", "Осн_дист": "СИТО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "СОВА", "Прайм_дист": "ЛИПА", "Осн_цель": "ЗОНТ", "Осн_дист": "ГИРЯ", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная" },
{"Прайм_цель": "КЛЁН", "Прайм_дист": "ЛИПА", "Осн_цель": "ПЛАЩ", "Осн_дист": "МЫЛО", "Тип_прайминга": "3", "Ответ_прайм": "живое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ШКАФ", "Прайм_дист": "ЗОНТ", "Осн_цель": "СТУЛ", "Осн_дист": "СИТО", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "СТУЛ", "Прайм_дист": "ШКАФ", "Осн_цель": "ИГЛА", "Осн_дист": "ГИРЯ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "СИТО", "Прайм_дист": "МЫЛО", "Осн_цель": "СИТО", "Осн_дист": "ИГЛА", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ИГЛА", "Прайм_дист": "СТУЛ", "Осн_цель": "ГИРЯ", "Осн_дист": "МЫЛО", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "СИТО", "Осн_цель": "МЫЛО", "Осн_дист": "ЗОНТ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "ГИРЯ", "Осн_цель": "ПЛАЩ", "Осн_дист": "ШКАФ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "МЫЛО", "Прайм_дист": "ИГЛА", "Осн_цель": "ЗОНТ", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "МЫЛО", "Осн_цель": "ШКАФ", "Осн_дист": "СТУЛ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ШКАФ", "Прайм_дист": "СТУЛ", "Осн_цель": "ЗОНТ", "Осн_дист": "ШКАФ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "СТУЛ", "Прайм_дист": "ШКАФ", "Осн_цель": "ИГЛА", "Осн_дист": "СТУЛ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "СИТО", "Прайм_дист": "СТУЛ", "Осн_цель": "МЫЛО", "Осн_дист": "СИТО", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ИГЛА", "Прайм_дист": "СИТО", "Осн_цель": "ГИРЯ", "Осн_дист": "ИГЛА", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ГИРЯ", "Прайм_дист": "ИГЛА", "Осн_цель": "СИТО", "Осн_дист": "ГИРЯ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "МЫЛО", "Прайм_дист": "ГИРЯ", "Осн_цель": "ПЛАЩ", "Осн_дист": "МЫЛО", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ЗОНТ", "Прайм_дист": "ПЛАЩ", "Осн_цель": "ШКАФ", "Осн_дист": "ЗОНТ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"},
{"Прайм_цель": "ПЛАЩ", "Прайм_дист": "МЫЛО", "Осн_цель": "ЗОНТ", "Осн_дист": "ПЛАЩ", "Тип_прайминга": "филер", "Ответ_прайм": "неживое", "Ответ_цель": "неживое", "Тип_пробы": "основная"}
];
stimules[0] = test.concat(shuffle(stimules[0]))
stimules[1] = test.concat(shuffle(stimules[1]))
stimules[2] = test.concat(shuffle(stimules[2]))

}
      },
      "title": "Инструкция (*код на последовательность)"
    },
    {
      "type": "lab.flow.Loop",
      "templateParameters": [
        {
          "tmp1": "tmp"
        }
      ],
      "sample": {
        "mode": "sequential",
        "n": "${ stimules[list].length }"
      },
      "files": {},
      "responses": {
        "": ""
      },
      "parameters": {},
      "messageHandlers": {},
      "title": "Цикл",
      "indexParameter": "counter",
      "shuffleGroups": [],
      "template": {
        "type": "lab.flow.Sequence",
        "files": {},
        "responses": {
          "": ""
        },
        "parameters": {},
        "messageHandlers": {},
        "title": "Последовательность",
        "content": [
          {
            "type": "lab.canvas.Screen",
            "content": [
              {
                "type": "i-text",
                "left": 0,
                "top": 0,
                "angle": 0,
                "width": 18.69,
                "height": 36.16,
                "stroke": null,
                "strokeWidth": 1,
                "fill": "black",
                "text": "+",
                "fontStyle": "normal",
                "fontWeight": "normal",
                "fontSize": 32,
                "fontFamily": "sans-serif",
                "lineHeight": 1.16,
                "textAlign": "center"
              }
            ],
            "viewport": [
              800,
              600
            ],
            "files": {},
            "responses": {
              "": ""
            },
            "parameters": {},
            "messageHandlers": {},
            "title": "Крест",
            "timeout": "500"
          },
          {
            "type": "lab.html.Page",
            "items": [
              {
                "required": true,
                "type": "html",
                "content": "\u003Ccenter class=\"prob\"\u003E\r\n\u003Cdiv class=\"target\"\u003E${ stimules[list][parameters.counter][\"Прайм_цель\"]}\u003C\u002Fdiv\u003E\r\n\u003Cdiv class=\"distractor\"\u003E${ stimules[list][parameters.counter][\"Прайм_дист\"] }\u003C\u002Fdiv\u003E\r\n\u003C\u002Fcenter\u003E",
                "name": ""
              }
            ],
            "scrollTop": true,
            "submitButtonText": "Continue →",
            "submitButtonPosition": "hidden",
            "files": {},
            "responses": {},
            "parameters": {},
            "messageHandlers": {
              "end": function anonymous(
) {
this.state['Прайм_цель'] = stimules[list][this.parameters.counter]['Прайм_цель']
this.state['Прайм_дист'] = stimules[list][this.parameters.counter]['Прайм_дист']
this.state['Осн_цель'] = stimules[list][this.parameters.counter]['Осн_цель']
this.state['Осн_дист'] = stimules[list][this.parameters.counter]['Осн_дист']


this.state['Ответ_прайм'] = stimules[list][this.parameters.counter]['Ответ_прайм']
this.state['Ответ_цель'] = stimules[list][this.parameters.counter]['Ответ_цель']

this.state['Тип_прайминга'] = stimules[list][this.parameters.counter]['Тип_прайминга']
this.state['Тип_пробы'] = stimules[list][this.parameters.counter]['Тип_пробы']

window.prime_ended_on = this.data.ended_on
window.prime_correct = this.data.correct


},
              "before:prepare": async function anonymous(
) {

const codec = 'audio/ogg; codecs=opus';
const stop_event = 'keydown(Space)';


let setupRecorder = function(stream) {
  console.log("Preparing recorder...");
  
  let mediaRecorder = new MediaRecorder(stream);
  let chunks = []; 
 
  mediaRecorder.onstart = function() {
    console.log("Recording started...");
  }

  mediaRecorder.onstop = async function() {
    console.log("Recording stopped...");

    blobToAudio = (blob) => {
      return new Promise((resolve, reject) => {
        let reader = new FileReader();

        reader.onloadend = () => resolve(reader.result);
        reader.onerror = reject;

        reader.readAsDataURL(blob);
      })
    }

    const blob = new Blob(chunks, { 'type' : codec });
    let audio = await blobToAudio(blob);

    c.options.datastore.set('audio', audio);
    console.log("data stored...");

    c.end(reason = stop_event);
  }

  mediaRecorder.ondataavailable = function(e) {
    chunks.push(e.data);
  }

  return(mediaRecorder);
}


let c = this;


// add event listener for ending the recording *before prepare!*
c.options.events[stop_event] = (e) => {
    console.log(e);
    if (recorder.state == 'recording') recorder.stop();
  }


// setup recorder as early as possible before run
let stream = await navigator.mediaDevices.getUserMedia({ audio: true });
let recorder = await setupRecorder(stream);


c.waitFor('run').then(() => recorder.start())
}
            },
            "title": "Прайм",
            "timeout": "2500"
          },
          {
            "type": "lab.html.Page",
            "items": [
              {
                "type": "text",
                "content": "\u003Ccenter class=\"prob\"\u003EСлишком поздно\u003C\u002Fcenter\u003E"
              }
            ],
            "scrollTop": true,
            "submitButtonText": "Continue →",
            "submitButtonPosition": "hidden",
            "files": {},
            "responses": {
              "": ""
            },
            "parameters": {},
            "messageHandlers": {},
            "title": "Прайм_timeout",
            "timeout": "1000",
            "tardy": true,
            "skip": "${ prime_ended_on != \"timeout\" }"
          },
          {
            "type": "lab.canvas.Screen",
            "content": [
              {
                "type": "i-text",
                "left": 0,
                "top": 0,
                "angle": 0,
                "width": 18.69,
                "height": 36.16,
                "stroke": null,
                "strokeWidth": 1,
                "fill": "black",
                "text": "+",
                "fontStyle": "normal",
                "fontWeight": "normal",
                "fontSize": 32,
                "fontFamily": "sans-serif",
                "lineHeight": 1.16,
                "textAlign": "center"
              }
            ],
            "viewport": [
              800,
              600
            ],
            "files": {},
            "responses": {
              "": ""
            },
            "parameters": {},
            "messageHandlers": {},
            "title": "Крест",
            "timeout": "700"
          },
          {
            "type": "lab.html.Page",
            "items": [
              {
                "required": true,
                "type": "html",
                "content": "\u003Ccenter class=\"prob\"\u003E\r\n\u003Cdiv class=\"target\"\u003E${ stimules[list][parameters.counter][\"Осн_цель\"] }\u003C\u002Fdiv\u003E\r\n\u003Cdiv class=\"distractor\"\u003E${ stimules[list][parameters.counter][\"Осн_дист\"] }\u003C\u002Fdiv\u003E\r\n\u003C\u002Fcenter\u003E",
                "name": ""
              }
            ],
            "scrollTop": true,
            "submitButtonText": "Continue →",
            "submitButtonPosition": "hidden",
            "files": {},
            "responses": {},
            "parameters": {},
            "messageHandlers": {
              "end": function anonymous(
) {
this.state['Прайм_цель'] = stimules[list][this.parameters.counter]['Прайм_цель']
this.state['Прайм_дист'] = stimules[list][this.parameters.counter]['Прайм_дист']
this.state['Осн_цель'] = stimules[list][this.parameters.counter]['Осн_цель']
this.state['Осн_дист'] = stimules[list][this.parameters.counter]['Осн_дист']
this.state['Ответ_прайм'] = stimules[list][this.parameters.counter]['Ответ_прайм']
this.state['Ответ_цель'] = stimules[list][this.parameters.counter]['Ответ_цель']
this.state['Тип_прайминга'] = stimules[list][this.parameters.counter]['Тип_прайминга']
this.state['Тип_пробы'] = stimules[list][this.parameters.counter]['Тип_пробы']

window.target_ended_on = this.data.ended_on
window.target_correct = this.data.correct
},
              "before:prepare": async function anonymous(
) {
const codec = 'audio/ogg; codecs=opus';
const stop_event = 'keypress(Space)';

let setupRecorder = function(stream) {
  console.log("Preparing recorder...");
  
  let mediaRecorder = new MediaRecorder(stream);
  let chunks = []; 
 
  mediaRecorder.onstart = function() {
    console.log("Recording started...");
  }

  mediaRecorder.onstop = async function() {
    console.log("Recording stopped...");

    blobToAudio = (blob) => {
      return new Promise((resolve, reject) => {
        let reader = new FileReader();

        reader.onloadend = () => resolve(reader.result);
        reader.onerror = reject;

        reader.readAsDataURL(blob);
      })
    }

    const blob = new Blob(chunks, { 'type' : codec });
    let audio = await blobToAudio(blob);

    c.options.datastore.set('audio', audio);
    console.log("data stored...");

    c.end(reason = stop_event);
  }

  mediaRecorder.ondataavailable = function(e) {
    chunks.push(e.data);
  }

  return(mediaRecorder);
}


let c = this;


// add event listener for ending the recording *before prepare!*
c.options.events[stop_event] = (e) => {
    console.log(e);
    if (recorder.state == 'recording') recorder.stop();
    console.log(c)
  }


// setup recorder as early as possible before run
let stream = await navigator.mediaDevices.getUserMedia({ audio: true });
let recorder = await setupRecorder(stream);


c.waitFor('run').then(() => recorder.start())
}
            },
            "title": "Цель",
            "timeout": "2500"
          },
          {
            "type": "lab.html.Page",
            "items": [
              {
                "type": "text",
                "content": "\u003Ccenter class=\"prob\"\u003EСлишком поздно\u003C\u002Fcenter\u003E"
              }
            ],
            "scrollTop": true,
            "submitButtonText": "Continue →",
            "submitButtonPosition": "hidden",
            "files": {},
            "responses": {
              "": ""
            },
            "parameters": {},
            "messageHandlers": {},
            "title": "Цель_timeout",
            "timeout": "1000",
            "tardy": true,
            "skip": "${ target_ended_on != \"timeout\" }"
          },
          {
            "type": "lab.canvas.Screen",
            "content": [],
            "viewport": [
              800,
              600
            ],
            "files": {},
            "responses": {
              "": ""
            },
            "parameters": {},
            "messageHandlers": {},
            "title": "Пустой экран",
            "timeout": "2000"
          },
          {
            "type": "lab.html.Page",
            "items": [
              {
                "type": "text",
                "content": "\u003Ccenter\u003E Вы прошли половину исследования. \u003Cbr\u003E У Вас есть возможность передохнуть пару минут, прежде чем перейти ко второй половине. \n\u003Cbr\u003E\n\u003Cbr\u003E\nНажмите \u003Ckbd\u003EПРОБЕЛ\u003C\u002Fkbd\u003E, чтобы продолжить \n\u003C\u002Fcenter\u003E"
              }
            ],
            "scrollTop": true,
            "submitButtonText": "Дальше →",
            "submitButtonPosition": "hidden",
            "files": {},
            "responses": {
              "keydown(Enter)": "Enter",
              "keydown(Space)": "Space"
            },
            "parameters": {},
            "messageHandlers": {},
            "title": "Перерыв",
            "skip": "${ parameters.counter != 35 }"
          },
          {
            "type": "lab.html.Page",
            "items": [
              {
                "type": "text",
                "content": "\u003Ccenter\u003E \nТестовая серия завершена. Далее следует основная часть исследования.\n\u003Cbr\u003E\n\u003Cbr\u003E\nНажмите \u003Ckbd\u003EПРОБЕЛ\u003C\u002Fkbd\u003E, чтобы перейти к основной части \n\u003C\u002Fcenter\u003E"
              }
            ],
            "scrollTop": true,
            "submitButtonText": "Дальше →",
            "submitButtonPosition": "hidden",
            "files": {},
            "responses": {
              "keydown(Enter)": "Enter",
              "keydown(Space)": "Space"
            },
            "parameters": {},
            "messageHandlers": {},
            "title": "Конец тестовой пробы",
            "skip": "${ parameters.counter != 4}"
          }
        ]
      }
    }
  ]
})

// Let's go!
study.run()