function addbits(s) {
    return (s.replace(/\s/g, '').match(/[+\-]?([0-9\.]+)/g) || [])
        .reduce(function(sum, value) {
            return parseFloat(sum) + parseFloat(value);
        });
}

function load_biography(dt) {
	window.biography = dt;
}

function load_test() {
	window.test = {
	  "answer_time": 1500,
	  "target": [
	    "17 + 33", 
	    "62 + 26",  
	    ],
	}
}

function load_main() {
	let sequences = {};

	sequences.base_priming_type = [
		//две псевдослучайные последовательноси
		{"1": 1,"2": 1,"3": 2,"4": 2,"5": 1,"6": 1,"7": 2,"8": 1,"9": 1,"10": 2,"11": 1,"12": 2,"13": 2,"14": 1,"15": 2,"16": 1,"17": 2,"18": 1,"19": 2,"20": 1,"21": 1,"22": 1,"23": 2,"24": 1,"25": 1,"26": 2,"27": 1,"28": 1,"29": 2,"30": 2,"31": 2,"32": 1,"33": 1,"34": 2,"35": 1,"36": 2,"37": 2,"38": 1,"39": 2,"40": 1,"41": 1,"42": 2,"43": 2,"44": 1,"45": 1,"46": 2,"47": 2,"48": 1,"49": 1,"50": 2,"51": 1,"52": 2,"53": 1,"54": 1,"55": 1,"56": 2,"57": 2,"58": 1,"59": 2,"60": 2,"61": 2,"62": 1,"63": 1,"64": 2,"65": 1,"66": 2,"67": 2,"68": 2,"69": 2,"70": 2,"71": 1,"72": 1,"73": 1,"74": 2,"75": 2,"76": 2,"77": 1,"78": 2,},
		{"1": 2,"2": 2,"3": 1,"4": 1,"5": 2,"6": 2,"7": 1,"8": 2,"9": 2,"10": 1,"11": 2,"12": 1,"13": 1,"14": 2,"15": 1,"16": 2,"17": 1,"18": 2,"19": 1,"20": 2,"21": 2,"22": 2,"23": 1,"24": 2,"25": 2,"26": 1,"27": 2,"28": 2,"29": 1,"30": 1,"31": 1,"32": 2,"33": 2,"34": 1,"35": 2,"36": 1,"37": 1,"38": 2,"39": 1,"40": 2,"41": 2,"42": 1,"43": 1,"44": 2,"45": 2,"46": 1,"47": 1,"48": 2,"49": 2,"50": 1,"51": 2,"52": 1,"53": 2,"54": 2,"55": 2,"56": 1,"57": 1,"58": 2,"59": 1,"60": 1,"61": 1,"62": 2,"63": 2,"64": 1,"65": 2,"66": 1,"67": 1,"68": 1,"69": 1,"70": 1,"71": 2,"72": 2,"73": 2,"74": 1,"75": 1,"76": 1,"77": 2,"78": 1,},
	];
	sequences.priming_type = [];
	let sq = [];
	//заполняются пресеты для каждого человека
	for (var i = 0; i <= 60; i++)
		sequences.priming_type[i] = (i % 2 ==  0) ? sequences.base_priming_type[0] : sequences.base_priming_type[1]
	
	console.log(sequences.priming_type);

	sequences.targets = {
	  "1": [88, 81],
	  "2": [20, 28],
	  "3": [71, 79],
	  "4": [60, 50],
	  "5": [31, 24],
	  "6": [47, 59],
	  "7": [41, 47],
	  "8": [10, 17],
	  "9": [16, 26],
	  "10":[81, 75],
	  "11":[49, 59],
	  "12":[31, 38],
	  "13":[78, 68],
	  "14":[68, 59],
	  "15":[36, 44],
	  "16":[94, 87],
	  "17":[53, 63],
	  "18":[78, 58],
	  "19":[34, 25],
	  "20":[44, 50],
	  "21":[24, 17],
	  "22":[93, 80],
	  "23":[87, 97],
	  "24":[32, 44],
	  "25":[76, 82],
	  "26":[65, 71],
	  "27":[32, 40],   
	  "28":[28, 38],
	  "29":[74, 64],
	  "30":[79, 89],
	  "31":[75, 68],
	  "32":[45, 39],
	  "33":[37, 45],
	  "34":[53, 64],
	  "35":[93, 83],
	  "36":[18, 28],
	  "37":[41, 38],
	  "38":[94, 85],
	  "39":[90, 86],
	  "40":[20, 29],
	  "41":[75, 87],
	  "42":[74, 80],
	  "43":[30, 20],
	  "44":[47, 41],
	  "45":[67, 73],
	  "46":[64, 74],
	  "47":[87, 95],
	  "48":[70, 62],
	  "49":[20, 30],
	  "50":[83, 93],
	  "51":[23, 16],
	  "52":[91, 81],
	  "53":[61, 53],
	  "54":[33, 29],
	  "55":[71, 84],
	  "56":[23, 39],
	  "57":[25, 37],
	  "58":[12, 25],
	  "59":[58, 49],
	  "60":[42, 50],
	}
	sequences.priming_right = [
		"аткрытие",
		"жилание",
		"калесо",
		"ахотник",
		"ошипка",
		"песьмо",
		"рибята",
		"офециант",
		"комот",
		"васторг",
		"титрадь",
		"ростение",
		"молако",
		"праблема",
		"придмет",
		"стокан",
		"таварищ",
		"цвиток",
		"парядок",
		"сабытие",
		"довление",
		"квортира",
		"римонт",
		"жывопись",
		"ажидание",
		"периулок",
		"обарона",
		"плонета",
		"чимодан",
		"пестолет",
		"обищание",
		"сабрание",
		"рисурс",
		"автамат",
		"сазнание",
		"прагноз",
		"пабеда",
		"абучение",
		"рицепт",
		"сцинарий",
		"канец",
		"уражай",
		"любофь",
		"кортина",
		"сабака",
		"фомилия",
		"кледка",
		"вапрос",
		"зимля",
		"кмига",
		"нород",
		"месец",
		"савет",
		"пличо",
		"проэкт",
		"премер",
		"барьба",
		"гирой",
		"союс",
		"спосоп"
	]
	sequences.priming_wrong = [
		"открытие",
		"желание",
		"колесо",
		"охотник",
		"ошибка",
		"письмо",
		"ребята",
		"официант",
		"комод",
		"восторг",
		"тетрадь",
		"растение",
		"молоко",
		"проблема",
		"предмет",
		"стакан",
		"товарищ",
		"цветок",
		"порядок",
		"событие",
		"давление",
		"квартира",
		"ремонт",
		"живопись",
		"ожидание",
		"переулок",
		"оборона",
		"планета",
		"чемодан",
		"пистолет",
		"обещание",
		"собрание",
		"ресурс",
		"автомат",
		"сознание",
		"прогноз",
		"победа",
		"обучение",
		"рецепт",
		"сценарий",
		"конец",
		"урожай",
		"любовь",
		"картина",
		"собака",
		"фамилия",
		"клетка",
		"вопрос",
		"земля",
		"книга",
		"народ",
		"месяц",
		"совет",
		"плечо",
		"проект",
		"пример",
		"борьба",
		"герой",
		"союз",
		"способ"
	]

	window.main = {
	  prime: Object.assign({}, sequences.priming), 
	  prime_type: Object.assign({}, sequences.priming_type[window.biography.subject_number-1]), 
	  target:  Object.assign({}, sequences.targets), 
	  right: sequences.priming_right, 
	  wrong: sequences.priming_wrong,
	  switch: false,
	  answers: {},
	  answer_duration: [],

	  switch_prime_type: function(data_, from_, to_) {
	  	if(!this.switch)
	  		return from__;

	  	if(data_ == from__)	
	  		return to__;
	  	return from__;
	  },
	  get_from_type: function(i) {
	  	i++;
	  	return this.prime_type[i] == 1 ? this.right[i-1] : this.wrong[i-1];
	  },
	  get_left: function(i) {
	  	i++;
	  	
	  	let o = 32490 / 100 * this.target[i][0]
	  	console.log(i)
	  	console.log(o)
	  	o = o / 190
	  	console.log(o)
	  	return o
	  },
	  get_right: function(i) {
	  	i++;
	  	let o = 32400/ 100 * this.target[i][1]
	  	console.log(i)
	  	console.log(o)
	  	o = o / 120
	  	console.log(o)
	  	return o
	  },
	  get_answer: function(key) {
	  	return this.answers[key]
	  },
	  set_answer: function(i, time, key) {
	  	i++;
	  	this.answers[i] = {"time": time, "key": key}
	  },
	  get_feedback_form: function() {
	  	let html = ''
	  	
	  },
	  plot: function(div) {
	  	let y1 = [],
	  		y2 = []

	  	for(i in this.prime_type) {
	  		console.log(i)
	  		console.log(this.prime_type[i])
	  		if(i > 60) continue;
	  		if(this.answers[i].time == -1) continue;

	  		if(this.prime_type[i] == 1)
	  			y1.push(this.answers[i].time)
	  		else
	  			y2.push(this.answers[i].time)
	  	}
	  	let trace1 = {
		  y: y1,
		  name: 'слова без ошибок',
		  marker: {color: '#407740c4'},
		  type: 'box' 
		};


		let trace2 = {
  			y: y2,
  			name: 'слова с ошибками',
  			marker: {color: '#FF4136'},
  			type: 'box'
		};


		let data = [trace1, trace2];

		Plotly.newPlot(div, data);

	  }

	}
	delete sequences;
}
